/* Алгоритм без сховища
    1. отримати посилання на всі дом елементи+
    2. повісити обробники подій на кнопку едд(по кліку) і на список ul(для делегування по кліку)
    3. функціонал додавання нової замітки
        3.1. зчитати текст з інпуту
        3.2. перевірка на пусте значення(повідомляти користувача)
        3.3. створення нової лішки
        3.4. додавання лішки у список
        3.5. очистити поле вводу
    4. функціонал виконаної задачі (ф-ція яка додає клас чекд або прибирає його)
    5. при натисканні на крестик - видалити елемент */

import refs from "./refs.js";
import { addNewTask, handleTasksbehaviour } from "./functions.js";

refs.addBtn.addEventListener("click", addNewTask);
refs.myUL.addEventListener("click", handleTasksbehaviour);
